src/srm_client/templates/WaitForUpdatesEx.xml

<soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <WaitForUpdatesEx xmlns="urn:internaldr0">
      <_this xmlns:internalvim25="urn:internalvim25" xsi:type="internalvim25:ManagedObjectReference" type="PropertyCollector">{{ key }}</_this>
      <version>{{ version }}</version>
      <options xmlns:internalvim25="urn:internalvim25">
        <internalvim25:maxWaitSeconds>300</internalvim25:maxWaitSeconds>
      </options>
    </WaitForUpdatesEx>
  </soap:Body>
</soap:Envelope>
